<?php

use Illuminate\Database\Seeder;

class QuestionsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
		//Set1
        DB::table('questions')->insert([
            'question_name' => 'ในเวลาที่ฉันทำงาน และต้องการวิเคราะห์ข้อมูล ฉันมักจะ..',
            'choice1' => 'ใช้ความคิดสร้างสรรค์ และใช้จินตนาการ ว่าทุกสิ่งเป็นไปได้เสมอ',
            'choice1_type' => 'N',
            'choice2' => 'ใช้ความรู้สึกของฉันที่เกิดขึ้นจริง ตระหนักถึงความจริง และสิ่งที่จับต้องได้',
            'choice2_type' => 'S',
			'set' => '1',
        ]);

        DB::table('questions')->insert([
            'question_name' => 'เมื่อต้องตัดสินใจเรื่องสำคัญ ฉันเชื่อว่า..',
            'choice1' => 'ใช้สัญชาตญาณนำทาง จะนำไปสู่คำตอบที่ใช่',
            'choice1_type' => 'N',
            'choice2' => 'ใช้ประสบการณ์และข้อมูลที่รวมรวมมาได้ จะนำไปสู่คำตอบที่ใช่',
            'choice2_type' => 'S',
			'set' => '1',
        ]);

        DB::table('questions')->insert([
            'question_name' => 'ในเรื่องความสัมพันธ์กับผู้อื่นทั้งเพื่อนร่วมงาน ครอบครัว หรือคนรัก ฉันเชื่อว่า...',
            'choice1' => 'เน้นเร่งการพัฒนาความสัมพันธ์ให้ดีขึ้นทุกครั้งเมื่อมีโอกาส เช่น ในหลายๆ ครั้ง ฉันจะชอบเข้าไปถามไถ่ความรู้สึกคนรอบข้าง เพื่อให้อีกฝ่ายประทับใจ และความสัมพันธ์จะได้ดีขึ้นทุกๆ ครั้ง',
            'choice1_type' => 'N',
            'choice2' => 'ไม่ต้องรีบเร่งอะไร ปล่อยไปตามธรรมชาติ ถ้าความสัมพันธ์นั้นยังไม่ได้มีปัญหา ก็ยังไม่ต้องจัดการอะไร',
            'choice2_type' => 'S',
			'set' => '1',
        ]);

        DB::table('questions')->insert([
            'question_name' => 'เมื่ออยู่กับคนสนิท ไม่ว่าจะเพื่อนร่วมงาน คนรัก หรือคนในครอบครัว ฉันชอบที่จะพูดเรื่อง....',
            'choice1' => 'เรื่องเกี่ยวกับความฝันที่อยากจะทำในอนาคต หรือแผนในการใช้ชีวิต แผนการทำงานในอนาคต',
            'choice1_type' => 'N',
            'choice2' => 'เรื่องเกี่ยวกับปัจจุบัน เช่นเรื่องานที่กำลังทำอยู่ หรือเรื่องที่ตัวเองกำลังเจออยู่',
            'choice2_type' => 'S',
			'set' => '1',
        ]);

        DB::table('questions')->insert([
            'question_name' => 'ในเวลาที่ฉันทำงาน ฉันมักจะเป็นคนที่....',
            'choice1' => 'ชอบมองภาพรวมเป็นอันดับแรก เพื่อจะดูสิ่งที่จะต้องทำ ก่อนที่จะลงมือปฎิบัติ',
            'choice1_type' => 'N',
            'choice2' => 'ชอบมองไปที่รายละเอียด การลงลึกในรายละเอียดก่อน เพื่อดูสิ่งที่จะต้องทำ ก่อนที่จะลงมือปฎิบัติ',
            'choice2_type' => 'S',
			'set' => '1',
        ]);

        DB::table('questions')->insert([
            'question_name' => 'ทั้งเรื่องการทำงาน และเรื่องส่วนตัว ฉันชอบที่จะ...',
            'choice1' => 'ชอบที่จะสนุกอยู่กับความฝัน และจินตนาการที่ฉันอยากจะเป็น แม้ว่าความฝันนั้นอาจจะเป็นจริงได้ หรือไม่ได้ก็ตาม',
            'choice1_type' => 'N',
            'choice2' => 'ชอบที่จะอยู่กับความจริง สิ่งที่จับต้องได้ แม้มันจะห่างจากความฝันที่ฉันคิดไว้',
            'choice2_type' => 'S',
			'set' => '1',
        ]);

        DB::table('questions')->insert([
            'question_name' => 'ถ้าฉันมีความฝัน ฉันชอบที่จะ..',
            'choice1' => 'ฝันถึงสิ่งที่ยิ่งใหญ่ในเรื่องที่ฉันทำ เช่น ฉันมักจะมีความฝันว่าวันหนึ่งฉันจะเติมโตในหน้าที่การงาน และมีตำแหน่งที่ดีในอนาคต',
            'choice1_type' => 'N',
            'choice2' => 'ฝันถึงสิ่งเล็กๆ ที่คิดว่าตัวเองสามารถทำได้ โดยอาศัยจากประสบการณ์ของตัวเองเป็นหลัก',
            'choice2_type' => 'S',
			'set' => '1',
        ]);
		
		//Set 2
		DB::table('questions')->insert([
            'question_name' => 'ถ้าฉันต้องคัดเลือกทีมงานหนึ่งคน มาร่วมทำงานโปรเจคใหม่ ฉันจะ...',
            'choice1' => 'ใช้ความรู้สึกตัดสิน เลือกคนที่ถูกชะตา และคิดว่าเข้ากันได้',
            'choice1_type' => 'F',
            'choice2' => 'ดูคุณสมบัติอย่างละเอียด เช็คประวัติการทำงาน และความตั้งใจ',
            'choice2_type' => 'T',
			'set' => '2',
        ]);

        DB::table('questions')->insert([
            'question_name' => 'เมื่ออยู่กับคนรอบข้าง คนรัก คนในครอบครัว หรือเพื่อนร่วมงาน ถ้าคนๆ นั้นมีอาการแปลกๆ ฉันมักจะจับสังเกตได้เสมอว่า....',
            'choice1' => 'คนๆนั้นกำลังหดหู่ หรือต้องการกำลังใจ',
            'choice1_type' => 'F',
            'choice2' => 'คนๆ นั้น เริ่มที่จะทำตัวแบบไม่มีเหตุผล และไม่เหมาะสม',
            'choice2_type' => 'T',
			'set' => '2',
        ]);
		
		DB::table('questions')->insert([
            'question_name' => 'ในวันที่ฉันเลิกกับแฟน...',
            'choice1' => 'ฉันมักเสียใจอย่างหนัก คิดซ้ำๆ เกี่ยวกับกับความสัมพันธ์ที่จบลง และการตัดใจเป็นเรื่องที่ค่อนข้างยากมาก',
            'choice1_type' => 'F',
            'choice2' => 'ถึงแม้จะรู้สึกเจ็บปวด แต่เมื่อถึงตอนที่ต้องตัดใจ ฉันสามารถที่จะตัดแฟนเก่าออกไปจากสมองทันที',
            'choice2_type' => 'T',
			'set' => '2',
        ]);
		
		DB::table('questions')->insert([
            'question_name' => 'เมื่อฉันเลือกคบใครซักคน ฉันเลือกคนที่...',
            'choice1' => 'คนที่มองตาก็รู้ใจ เข้าใจอารมณ์ความรู้สึกของกันและกัน โดยไม่ต้องพูดคุย',
            'choice1_type' => 'F',
            'choice2' => 'เน้นการพูดคุยใช้เหตุผล พูดกันตรงๆ แสดงออกตรงๆ บนพื้นฐานของความเป็นจริง',
            'choice2_type' => 'T',
			'set' => '2',
        ]);
		
		DB::table('questions')->insert([
            'question_name' => 'เมื่อฉันไม่เห็นด้วยกับคนใกล้ตัว',
            'choice1' => 'ฉันเลือกจะหลีกเลี่ยงการทำร้ายจิตใจอีกฝ่าย และจะไม่พูดอะไรถ้ามันจะทำให้รู้สึกไม่ดี',
            'choice1_type' => 'F',
            'choice2' => 'ฉันจะพูดออกไปตรงๆ เพื่อแก้ไขสิ่งที่ฉันคิดว่าผิด ให้เป็นสิ่งที่ถูกต้อง',
            'choice2_type' => 'T',
			'set' => '2',
        ]);
		
		DB::table('questions')->insert([
            'question_name' => 'หลายคนที่รู้จักฉันดี เช่นคนในครอบครัว คนรัก เพื่อนร่วมงาน มักจะบอกว่าฉันเป็นคนที่..',
            'choice1' => 'อบอุ่น โอบอ้อมอารี เห็นอกเห็นใจ อ่อนไหวต่อความรู้สึก',
            'choice1_type' => 'F',
            'choice2' => 'เป็นคนตรงๆ มีเหตุผล',
            'choice2_type' => 'T',
			'set' => '2',
        ]);
		
		DB::table('questions')->insert([
            'question_name' => 'วิธีที่ฉันใช้เมื่อต้องร่วมงานกับผู้อื่น คือ...',
            'choice1' => 'เข้าหาผู้อื่นด้วยความมีอัธยาศัยที่ดี เน้นพูดคุยให้มีความเป็นกันเอง และทำความรู้จักกับคนอื่น ไม่ใช่แค่เฉพาะเรื่องงานเท่านั้น',
            'choice1_type' => 'F',
            'choice2' => 'เข้าหาผู้อื่นแบบตรงประเด็น คุยเฉพาะสิ่งที่ต้องการ เพื่อให้ได้ผลลัพธ์ที่ถูกต้อง',
            'choice2_type' => 'T',
			'set' => '2',
        ]);
		
		
		//Set 3
		DB::table('questions')->insert([
            'question_name' => 'ถ้าอยู่ดีๆเพื่อนชวนไปเที่ยว โดยมีเวลาเตรียมตัวแค่วันเดียว ฉันจะ...',
            'choice1' => 'เช็คตารางนัดหมายก่อนเป็นอันดับแรก',
            'choice1_type' => 'J',
            'choice2' => 'จัดกระเป๋าโดยไม่ต้องคิดเลย',
            'choice2_type' => 'P',
			'set' => '3',
        ]);
		
		DB::table('questions')->insert([
            'question_name' => 'เมื่อคนที่ฉันนัดไว้มาสาย ฉันจะ...',
            'choice1' => 'ฉันจะหงุดหงิด และผิดหวัง',
            'choice1_type' => 'J',
            'choice2' => 'ฉันรู้สึกเฉยๆ เพราะตัวฉันเองก็มักจะสาย',
            'choice2_type' => 'P',
			'set' => '3',
        ]);
		
		DB::table('questions')->insert([
            'question_name' => 'ฉันมักที่จะใช้ชีวิตในแบบที่..',
            'choice1' => 'รู้ตารางชีวิตล่วงหน้า มีการวางแผนล่วงหน้าว่าฉันจะต้องทำอะไร ที่ไหน อย่างไร นานแค่ไหนแต่งตัวอย่างไร',
            'choice1_type' => 'J',
            'choice2' => 'ถ้าไม่ใช่เรื่องที่ซีเรียส ก็ไม่ต้องวางแผนอะไรล่วงหน้ามากนัก  เพราะการแก้ไขเหตุการณ์เฉพาะหน้า คือความสุขของชีวิต',
            'choice2_type' => 'P',
			'set' => '3',
        ]);
		
		DB::table('questions')->insert([
            'question_name' => 'ฉันชอบใช้ชีวิตในแบบที่..',
            'choice1' => 'มีความเป๊ะ มีแบบแผน และมีการจัดการที่ดี',
            'choice1_type' => 'J',
            'choice2' => 'มีความยืดหยุ่น ปรับเปลี่ยนได้ตามต้องการ',
            'choice2_type' => 'P',
			'set' => '3',
        ]);
		
		DB::table('questions')->insert([
            'question_name' => 'เมื่อมีนัดหมาย สิ่งที่เกิดขึ้นบ่อยๆคือ...',
            'choice1' => 'ฉันมาถึงทันเวลานัดเสมอ แต่คนอื่นๆ มักจะสาย',
            'choice1_type' => 'J',
            'choice2' => 'คนอื่นๆมักจะมารอฉัน แทบทุกครั้ง',
            'choice2_type' => 'P',
			'set' => '3',
        ]);
		
		DB::table('questions')->insert([
            'question_name' => 'เมื่อต้องตัดสินใจเรื่องใดเรื่องหนึ่ง ฉันชอบที่จะ...',
            'choice1' => 'คิดด้วยตนเอง ตัดสินใจเด็ดขาด',
            'choice1_type' => 'J',
            'choice2' => 'จเปิดกว้าง รับฟังทุกคน และเก็บข้อมูลไปเรื่อยๆ',
            'choice2_type' => 'P',
			'set' => '3',
        ]);
		
		DB::table('questions')->insert([
            'question_name' => 'เมื่อมีหลายๆ งานเข้ามาพร้อมๆ กัน ฉันมักจะ...',
            'choice1' => 'ชอบทำงานให้เสร็จทีละงาน ก่อนที่จะไปเริ่มงานใหม่',
            'choice1_type' => 'J',
            'choice2' => 'ชอบที่จะทำงานสลับไปมาหลายๆ งาน เพื่อให้เสร็จพร้อมกัน',
            'choice2_type' => 'P',
			'set' => '3',
        ]);
    }
}
